[
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 1. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 2. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 3. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 4. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 5. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 6. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 7. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 8. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 9. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 10. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 11. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 12. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 13. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 14. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 15. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 16. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 17. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 18. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 19. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 20. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 21. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 22. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 23. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 24. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 25. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 26. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 27. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 28. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 29. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 30. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 31. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 32. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 33. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 34. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 35. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 36. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 37. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 38. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 39. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 40. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 41. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 42. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 43. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 44. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 45. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 46. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 47. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 48. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 49. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 50. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 51. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 52. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 53. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 54. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 55. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 56. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 57. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 58. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 59. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 60. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 61. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 62. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 63. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Hiến pháp  ",
    "text": "Điều 64. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 65. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 66. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 67. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 68. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 69. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 70. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 71. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Phòng, chống tham nhũng  ",
    "text": "Điều 72. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 73. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 74. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 75. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 76. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 77. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 78. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 79. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Đất đai  ",
    "text": "Điều 80. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 81. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 82. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 83. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 84. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 85. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 86. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 87. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Luật Doanh nghiệp  ",
    "text": "Điều 88. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 89. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 90. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 91. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 92. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 93. Nghĩa vụ của cá nhân, tổ chức: Phải chấp hành đầy đủ các quy định của pháp luật, thực hiện nghĩa vụ tài chính, hợp tác với cơ quan nhà nước trong quá trình kiểm tra, thanh tra. Không được lợi dụng quyền tự do để vi phạm pháp luật hoặc xâm hại quyền, lợi ích hợp pháp của tổ chức, cá nhân khác."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 94. Các hành vi bị nghiêm cấm: Bao gồm lợi dụng chức vụ, quyền hạn để vụ lợi; tham nhũng; đưa và nhận hối lộ; gây phiền hà, sách nhiễu; lợi dụng sơ hở trong quản lý để trục lợi; tiết lộ bí mật nhà nước hoặc thông tin cá nhân trái phép; cản trở hoạt động thanh tra, kiểm tra."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 95. Trách nhiệm thi hành: Các bộ, ngành, chính quyền địa phương và tổ chức có liên quan phải phổ biến, hướng dẫn và tổ chức thực hiện đầy đủ các quy định của luật. Đồng thời, có trách nhiệm kiểm tra, giám sát việc thi hành và xử lý nghiêm các hành vi vi phạm."
  },
  {
    "Source": "Bộ luật Lao động  ",
    "text": "Điều 96. Điều khoản chuyển tiếp: Trong trường hợp các văn bản pháp luật được ban hành trước đây có nội dung trái với luật này thì kể từ ngày luật có hiệu lực, các nội dung đó sẽ hết hiệu lực. Các quy định chưa được hướng dẫn cụ thể vẫn tiếp tục áp dụng nếu không trái với luật này."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 97. Phạm vi điều chỉnh: Luật này quy định cụ thể về nguyên tắc hoạt động, quyền và nghĩa vụ của cá nhân, tổ chức liên quan đến lĩnh vực điều chỉnh; đồng thời xác định rõ trách nhiệm của các cơ quan nhà nước trong việc thực hiện, kiểm tra và giám sát thi hành pháp luật. Mục tiêu nhằm bảo đảm tính minh bạch, công khai, công bằng và hiệu lực trong quản lý nhà nước, ngăn chặn các hành vi vi phạm pháp luật."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 98. Đối tượng áp dụng: Luật áp dụng đối với toàn bộ cơ quan nhà nước, tổ chức chính trị, tổ chức chính trị - xã hội, tổ chức kinh tế và cá nhân trong phạm vi lãnh thổ Việt Nam. Các tổ chức, cá nhân nước ngoài hoạt động tại Việt Nam cũng phải tuân thủ các quy định liên quan. Quy định này nhằm đảm bảo sự thống nhất trong việc áp dụng pháp luật, không phân biệt thành phần kinh tế hay hình thức sở hữu."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 99. Nguyên tắc hoạt động: Mọi hoạt động thuộc phạm vi điều chỉnh của luật này phải tuân thủ Hiến pháp và pháp luật; bảo đảm tính minh bạch, công khai, hiệu quả, tiết kiệm và đúng mục tiêu. Việc thực hiện phải dựa trên nguyên tắc bình đẳng, không phân biệt đối xử, đồng thời tăng cường trách nhiệm giải trình của các chủ thể liên quan."
  },
  {
    "Source": "Luật Cán bộ, công chức  ",
    "text": "Điều 100. Quyền của cá nhân, tổ chức: Cá nhân, tổ chức có quyền được cung cấp thông tin, tiếp cận dịch vụ công, được bảo vệ quyền và lợi ích hợp pháp, được khiếu nại, tố cáo khi quyền lợi bị xâm phạm. Nhà nước có trách nhiệm tiếp nhận, xử lý kịp thời các kiến nghị, phản ánh, đảm bảo không ai bị xâm phạm quyền một cách trái pháp luật."
  },
{
        "Source": "Luật Doanh nghiệp 2020",
        "text": "Điều 4. Quyền thành lập, góp vốn, mua cổ phần: Mọi tổ chức, cá nhân đều có quyền thành lập, góp vốn, mua cổ phần, phần vốn góp vào doanh nghiệp theo quy định của pháp luật, trừ các trường hợp bị cấm theo quy định tại luật này.",
        "Type": "Kinh tế"
    },
    {
        "Source": "Luật Đầu tư 2020",
        "text": "Điều 6. Ngành, nghề cấm đầu tư kinh doanh: Cấm các hoạt động đầu tư kinh doanh liên quan đến ma túy, hóa chất, khoáng sản quý hiếm, mẫu vật hoang dã và các sản phẩm từ chúng; mại dâm, mua bán người, mô, bộ phận cơ thể người; hoạt động liên quan đến sinh sản vô tính trên người.",
        "Type": "Kinh tế"
    },
    {
        "Source": "Luật Giáo dục 2019",
        "text": "Điều 3. Mục tiêu giáo dục: Mục tiêu giáo dục là phát triển toàn diện con người Việt Nam về đạo đức, trí tuệ, thể chất, thẩm mỹ và nghề nghiệp; hình thành, bồi dưỡng nhân cách, phẩm chất và năng lực của công dân, đáp ứng yêu cầu xây dựng và bảo vệ Tổ quốc.",
        "Type": "Giáo dục"
    },
    {
        "Source": "Luật Giáo dục Đại học 2018",
        "text": "Điều 34. Tự chủ đại học: Cơ sở giáo dục đại học được quyền tự chủ trong việc quyết định mục tiêu, chiến lược, kế hoạch phát triển; tổ chức bộ máy; tuyển dụng và quản lý nhân sự; huy động, quản lý và sử dụng các nguồn lực theo quy định của pháp luật.",
        "Type": "Giáo dục"
    },
    {
        "Source": "Luật Thuế thu nhập doanh nghiệp 2008 (sửa đổi 2020)",
        "text": "Điều 13. Thuế suất ưu đãi: Doanh nghiệp có dự án đầu tư thuộc lĩnh vực, địa bàn ưu đãi đầu tư được áp dụng mức thuế suất ưu đãi 10% trong 15 năm; miễn thuế tối đa 4 năm và giảm 50% số thuế phải nộp trong 9 năm tiếp theo.",
        "Type": "Kinh tế"
    }
]